<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2942019bc4a1e63156782ffc45d6164f92c3db4a0932d05d28563f8ea041dc2f","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #655 at https://github.com/cal-itp/data-infra/actions/runs/17839131809","plan_out_hash":"543b3350016c954c7c914b472473dd89c46abbdd2a98dd86fcf1cbbf6c783c0f","plan_hash":"79193c246e46b219cc16a7db92df1b16c96739999c87ebef74b5c87e2f6b90b5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_filtered.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "SYBXnw==" -> (known after apply)
!~      detect_md5hash      = "Hak794Ex9LG8wBdgZNmz3w==" -> "different hash"
!~      generation          = 1758149007672707 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_filtered.py"
!~      md5hash             = "Hak794Ex9LG8wBdgZNmz3w==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_filtered.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "MjnOCg==" -> (known after apply)
!~      detect_md5hash      = "JJKAaR2PKuHC/o2iEldV9w==" -> "different hash"
!~      generation          = 1758149008874645 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "JJKAaR2PKuHC/o2iEldV9w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "6xMoUQ==" -> (known after apply)
!~      detect_md5hash      = "+5ngJExfD0AiZ8Y5xFkDSg==" -> "different hash"
!~      generation          = 1758149010663337 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "+5ngJExfD0AiZ8Y5xFkDSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #655](https://github.com/cal-itp/data-infra/actions/runs/17839131809)